// FIRST_DIGIT_GENERATOR
// Първа цифра

// За първата цифра от номера на картата системата изисква информация за годината, в която е роден клиентът:

// Клиентът въвежда годината на своето раждане:

//     ако е роден преди 1965, то цифрата е задължително нечетна;
//     ако е роден след 1965, то цифрата е задължително четна;
//     СПЕЦИАЛЕН СЛУЧАЙ ако е роден точно през 1965, то цифрата е 0 и приключваме генерирането на тази първа цифра.

// Ако клиентът не попадне в СПЕЦИАЛНИЯ СЛУЧАЙ, то системата:

//     изцислява годините на клиента, базирайки го годината която е въвел;
//     след това генерира случайно число в интервала от 1 до 7;
//     разделя възрастта на клиента с това число и полученият резултат се използва като първа цифра.

// Важно - задължително трябва да се съобразим с условието за четност и нечетност. Ако резултатът от горната операция е четно число, а потребителят е роден след 1965, то трябва резултатът да бъде модифициран, така че да се спази условието, като се промени текущата стойност с една единица.

// Пример

//     ако съм роден през 1979, то моята първа цифра трябва да е четна;
//     получавам от алгоритъма резултат - 7 (този резултат е примерен), който противоречи на условието;
//     валидна стойност би била 8.

// Допълнително уточнение

//     ако резултата е двуцифрено число, вземете само първата цифра от него.


const YearOfBirth = prompt(`Здравейте! Моля, споделете Вашата рождена дата!`);

if (YearOfBirth == 1965) {
    var FIRST_DIGIT_GENERATOR = 0;
}
if (YearOfBirth < 1965) {
    do {
        FIRST_DIGIT_GENERATOR = Math.floor(Math.random()*9 + 1)
    } while ( FIRST_DIGIT_GENERATOR % 2 !== 1 );
}
if (YearOfBirth > 1965) {
    var FIRST_DIGIT_GENERATOR;
    do {
        FIRST_DIGIT_GENERATOR = Math.floor(Math.random()*9 + 1)
    } while ( FIRST_DIGIT_GENERATOR % 2 == 1 );
}
console.log(`pyrwata cifra e ${FIRST_DIGIT_GENERATOR}`);

// SECOND_DIGIT_GENERATOR
// Втора цифра

// За втора цифра от номера на картата системата се интересува от пола на клиента:

//     ако той е мъжки - цифрата е 1
//     ако той е женски - цифрата е 3
//     ако потребителят не желае да избере пол, поради лични съображения, то тогава генерирайте случайно число в интервала от 1 до 9 включително, като съобразите факта, че числото не може да е, нито 1, нито 3.

// Важно уточнение - според специфичните правила за този софтуер. Ако първата цифра от номера на картата е 0, то втората цифра задължително е 9 и въпроса за пола трябва да бъде пропуснат.


// THIRD_DIGIT_GENERATOR
// Трета цифра

// Ако потребителят е НЕпълнолетен, накарайте го:

//     първо: да въведе годината на раждане на майка му;
//     второ: да въведе годината на раждане на баща му.

// Ако последната цифра на годината на майка му е равна на тази на баща му, то третата цифра от номера на клиентската карта е равна на предпоследната цифра от годината на майка му.

// Ако двете цифри са различни, то третата цифра от номера на картата е равна на последната цифра от годината на баща му.

// Ако потребителя е ПЪЛНОЛЕТЕН, числото в картата е 0.


// FOURTH_DIGIT_GENERATOR
// Четвърта цифра

// За да получите четвъртата цифра, трябва да въведете:

//     първо: вашата височина в сантиметри;
//     второ: вашето тегло в килограми.

// Системата изчислява индекса на телесната маса по формулата (тегло) разделено на (височина на квадрат). Резултатът от операцията трябва да е задължително дробно число.

// Цифрата се генерира на базата на следните интервали:
// цифра 	название 	символ
// под 16 	под норма 	генерираме цифра - 1
// от 16 до 16,99 	нормално 	генерираме цифра - 2
// от 17 до 18,49 	нормално - атлетично 	генерираме цифра - 3
// от 18,5 до 24,99 	нормално 	генерираме цифра - 4
// от 25 до 29,99 	пред наднормено 	генерираме цифра - 5
// от 30 до 34,99 	наднормено - дебел 	генерираме цифра - 6
// от 35 до 39,99 	наднормено - затлъстял 	генерираме цифра - 7
// от 40 и нагоре 	наднормено - мега затлъстял 	генерираме цифра - 8


// FIFTH_DIGIT_GENERATOR
// Пета цифра

// Петата цифра се определя от предпочитанията на потребителя, за стоки и услуги, на територията на магазина, както и честотата, с която те се консумират.

// Дайте му възможност, чрез текстово съобщение, да избере от 5 вида стоки, които консумира. Имате избор между следните възможности:

//         плодове и зеленчуци;
//         месо и месни продукти;
//         цигари и алкохол;
//         млечни продукти;
//         захарни изделия.

// За всеки един от продуктите трябва да изберете колко често го купувате, като използвате скалата от 1 до 3:

//     1 - рядко
//     2 - понякога
//     3 - често

// Цифрата е сумата от позицията на избрания продукт и честотата на пазаруване

// Пример:

//     Избрали сме позиция 3. Цигари и алкохол - честота понякога - резултата е 3 + 2




// SIXTH_DIGIT_GENERATOR
// Шеста цифра

// Шестата цифра е контролна, тя се подчинява на принципите на нумерологията и е резултат от сбора на всички предишни числа, сведени до едноцифрено такова.

// Пример - едноцифрено число Преди шеста цифра, потребителят е получил следните 5 цифри.

//     1
//     1
//     1
//     1
//     2

// Сборът на тези цифри е 6 . Значи шестата цифра е със стойност 6.

// Пример - двуцифрено число Преди шеста цифра, потребителят е получил следните 5 цифри.

//     5
//     3
//     8
//     4
//     6

// Сборът от тези цифри е 26. Прилагаме принципа на нумерологията и събираме 2 и 6, резултатът е 8. Значи шестата цифра е със стойност 8.